
## :white_check_mark: Apply Succeeded

[CI link](https://github.com/hawk0616/terraform-for-container-operation/actions/runs/5694780977)



<pre><code>Apply complete! Resources: 2 added, 0 changed, 0 destroyed.</code></pre>

<details><summary>Details (Click me)</summary>

```hcl
Acquiring state lock. This may take a few moments...
module.vpc.aws_vpc.this[0]: Refreshing state... [id=vpc-075058cf3c293747f]
module.vpc.aws_route_table.public[0]: Refreshing state... [id=rtb-0110bf1fc9c4088c2]
aws_security_group.ecs: Refreshing state... [id=sg-0ac74d3a206d70d04]
module.vpc.aws_default_security_group.this[0]: Refreshing state... [id=sg-0aadae0bd723083b6]
module.vpc.aws_default_network_acl.this[0]: Refreshing state... [id=acl-0393c7a160030dccf]
module.vpc.aws_route_table.private[1]: Refreshing state... [id=rtb-0ad7a27af85265202]
module.vpc.aws_default_route_table.default[0]: Refreshing state... [id=rtb-0d451342d3cfc463c]
aws_lb_target_group.target_group: Refreshing state... [id=arn:aws:elasticloadbalancing:ap-northeast-1:113713103169:targetgroup/go-for-api-target-group/7beb819d5c6a8417]
module.vpc.aws_route_table.private[0]: Refreshing state... [id=rtb-0a3adca757c7a29b2]
aws_security_group.alb: Refreshing state... [id=sg-0302e3d2b024b00f0]
module.vpc.aws_internet_gateway.this[0]: Refreshing state... [id=igw-08ba86b00c36d4b2a]
module.vpc.aws_subnet.public[1]: Refreshing state... [id=subnet-0159c63a097a933ae]
module.vpc.aws_subnet.private[0]: Refreshing state... [id=subnet-0ca36752b1b4ca25b]
module.vpc.aws_subnet.private[1]: Refreshing state... [id=subnet-0c3f487829a2e1587]
module.vpc.aws_subnet.public[0]: Refreshing state... [id=subnet-045e7a4287d60f218]
aws_security_group_rule.ecs_from_alb: Refreshing state... [id=sgrule-586569237]
module.vpc.aws_route.public_internet_gateway[0]: Refreshing state... [id=r-rtb-0110bf1fc9c4088c21080289494]
module.vpc.aws_eip.nat[0]: Refreshing state... [id=eipalloc-0854cdc54210a818e]
module.vpc.aws_eip.nat[1]: Refreshing state... [id=eipalloc-020770d2bf0cce94b]
module.vpc.aws_route_table_association.private[1]: Refreshing state... [id=rtbassoc-047bd52bbcf806376]
module.vpc.aws_route_table_association.private[0]: Refreshing state... [id=rtbassoc-0fd749b24ca4fea4b]
aws_lb.alb: Refreshing state... [id=arn:aws:elasticloadbalancing:ap-northeast-1:113713103169:loadbalancer/app/go-for-api-alb/ca621acff5f672b2]
module.vpc.aws_route_table_association.public[1]: Refreshing state... [id=rtbassoc-03ad33c2a0995ef02]
module.vpc.aws_route_table_association.public[0]: Refreshing state... [id=rtbassoc-094be487cdd8dc310]
module.vpc.aws_nat_gateway.this[0]: Refreshing state... [id=nat-082ec01efead41866]
module.vpc.aws_nat_gateway.this[1]: Refreshing state... [id=nat-03c7ba16c4f55b0a1]
module.vpc.aws_route.private_nat_gateway[1]: Refreshing state... [id=r-rtb-0ad7a27af852652021080289494]
module.vpc.aws_route.private_nat_gateway[0]: Refreshing state... [id=r-rtb-0a3adca757c7a29b21080289494]
aws_lb_listener.alb_listener: Refreshing state... [id=arn:aws:elasticloadbalancing:ap-northeast-1:113713103169:listener/app/go-for-api-alb/ca621acff5f672b2/6a595fa8f421ceb8]
aws_lb_listener_rule.alb_listener_rule: Refreshing state... [id=arn:aws:elasticloadbalancing:ap-northeast-1:113713103169:listener-rule/app/go-for-api-alb/ca621acff5f672b2/6a595fa8f421ceb8/2c11cb06da83f8ae]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # aws_ecr_lifecycle_policy.ecr_lifecycle_policy will be created
  + resource "aws_ecr_lifecycle_policy" "ecr_lifecycle_policy" {
      + id          = (known after apply)
      + policy      = jsonencode(
            {
              + rules = [
                  + {
                      + action       = {
                          + type = "expire"
                        }
                      + description  = "Keep last 30 images"
                      + rulePriority = 1
                      + selection    = {
                          + countNumber = 30
                          + countType   = "imageCountMoreThan"
                          + tagStatus   = "any"
                        }
                    },
                ]
            }
        )
      + registry_id = (known after apply)
      + repository  = "go-for-api"
    }

  # aws_ecr_repository.ecr_repository will be created
  + resource "aws_ecr_repository" "ecr_repository" {
      + arn                  = (known after apply)
      + force_delete         = true
      + id                   = (known after apply)
      + image_tag_mutability = "IMMUTABLE"
      + name                 = "go-for-api"
      + registry_id          = (known after apply)
      + repository_url       = (known after apply)
      + tags_all             = (known after apply)

      + image_scanning_configuration {
          + scan_on_push = true
        }
    }

Plan: 2 to add, 0 to change, 0 to destroy.
aws_ecr_repository.ecr_repository: Creating...
aws_ecr_repository.ecr_repository: Creation complete after 1s [id=go-for-api]
aws_ecr_lifecycle_policy.ecr_lifecycle_policy: Creating...
aws_ecr_lifecycle_policy.ecr_lifecycle_policy: Creation complete after 0s [id=go-for-api]
Releasing state lock. This may take a few moments...

Apply complete! Resources: 2 added, 0 changed, 0 destroyed.

```

</details>

<!-- github-comment: {"Command":"apply","JobName":"terraform","PRNumber":7,"Program":"tfcmt","SHA1":"012cb17f28fdaf862427f77dca8df295bb95e04a","Vars":{},"WorkflowName":"Terraform"} -->